In [1]:
import pandas as pd

In [2]:
data = pd.Series([1,2,3,4,5,6,7,8,9])

In [3]:
data

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
data.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data.tail()

4    5
5    6
6    7
7    8
8    9
dtype: int64

In [6]:
data = pd.Series([0,1,2,3,4,5], index=["a","b","c","d","e","f"])

In [7]:
data

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [8]:
dic = {"name ":"ali","surname":"ila"}
arr = pd.Series(dic)
arr

name       ali
surname    ila
dtype: object

In [9]:
type(arr)

pandas.core.series.Series

In [10]:
pd.DataFrame(arr)

           0
name     ali
surname  ila

In [11]:
list1 = [1,2,3,4,5,6,7]
df = pd.DataFrame(list1,columns=["number"])
df

   number
0       1
1       2
2       3
3       4
4       5
5       6
6       7

In [12]:
df.index=["a","b","c","d","e","f","g"]
df

   number
a       1
b       2
c       3
d       4
e       5
f       6
g       7

In [13]:
import numpy as np

In [14]:
df = pd.DataFrame(np.random.rand(6,2),
                  columns=["s1","s2"],
                  index=[0,1,2,3,4,5])
df

         s1        s2
0  0.585879  0.600195
1  0.500044  0.001564
2  0.829467  0.163676
3  0.854728  0.377296
4  0.405294  0.920563
5  0.368435  0.417393

In [15]:
df.iloc[0:3]

         s1        s2
0  0.585879  0.600195
1  0.500044  0.001564
2  0.829467  0.163676

In [16]:
df.loc[0:3, "s2"]

0    0.600195
1    0.001564
2    0.163676
3    0.377296
Name: s2, dtype: float64

In [17]:
df.s2

0    0.600195
1    0.001564
2    0.163676
3    0.377296
4    0.920563
5    0.417393
Name: s2, dtype: float64

In [18]:
df[df.s2<0.5]

         s1        s2
1  0.500044  0.001564
2  0.829467  0.163676
3  0.854728  0.377296
5  0.368435  0.417393

In [19]:
df[df.s2<0.5] ["s2"]

1    0.001564
2    0.163676
3    0.377296
5    0.417393
Name: s2, dtype: float64

In [20]:
data1={
'Ad':[ 'Ahmet', 'Mehmet ', 'Ali'],
'Numara' :[2000, 1202, 824],
'Şehir':['İstanbul','İzmir','Bursa']
}
data2={
'Ad':[ 'Ahmet', 'Mehmet ', 'Ali'],
'Numara' :[1234, 312312, 3113],
'Şehir':['İstanbul','İzmir','Bursa']
}

In [21]:
data1

{'Ad': ['Ahmet', 'Mehmet ', 'Ali'],
 'Numara': [2000, 1202, 824],
 'Şehir': ['İstanbul', 'İzmir', 'Bursa']}

In [22]:
adf=pd.DataFrame(data1)

In [23]:
bdf=pd.DataFrame(data2)

In [24]:
pd.concat([adf,bdf], ignore_index=True)

        Ad  Numara     Şehir
0    Ahmet    2000  İstanbul
1  Mehmet     1202     İzmir
2      Ali     824     Bursa
3    Ahmet    1234  İstanbul
4  Mehmet   312312     İzmir
5      Ali    3113     Bursa

In [25]:
data1={
'Ad':[ 'Ahmet', 'Mehmet ', 'Ali'],
'Numara' :[2000, 1202, 824],
'Şehir':['İstanbul','İzmir','Bursa']
}
data2={
'Ad':[ 'Ahmet', 'Mehmet ', 'Ali'],
'Yaş' :[12, 14, 15],
'Şehir':['İstanbul','İzmir','Bursa']
}

In [26]:
adf=pd.DataFrame(data1)

In [27]:
bdf=pd.DataFrame(data2)

In [28]:
pd.merge(adf,bdf)

        Ad  Numara     Şehir  Yaş
0    Ahmet    2000  İstanbul   12
1  Mehmet     1202     İzmir   14
2      Ali     824     Bursa   15

In [29]:
data1={
'Ad':[ 'Ahmet','Ali','Ali','Mehmet','Ali'],
'Yaş' :[12,33,12,14,13],
'Şehir':['İstanbul','Ankara','İzmir','Bursa','Trabzon']
}

In [30]:
adf=pd.DataFrame(data1)

In [31]:
adf

       Ad  Yaş     Şehir
0   Ahmet   12  İstanbul
1     Ali   33    Ankara
2     Ali   12     İzmir
3  Mehmet   14     Bursa
4     Ali   13   Trabzon

In [32]:
ag=adf.groupby("Ad")

In [33]:
ag

In [34]:
ag.first()

        Yaş     Şehir
Ad
Ahmet    12  İstanbul
Ali      33    Ankara
Mehmet   14     Bursa

In [35]:
ag.get_group("Ali")

    Ad  Yaş    Şehir
1  Ali   33   Ankara
2  Ali   12    İzmir
4  Ali   13  Trabzon

In [36]:
ag.mean(numeric_only=True).reset_index()

       Ad        Yaş
0   Ahmet  12.000000
1     Ali  19.333333
2  Mehmet  14.000000